SCHEMA = "jp"
STUDY_YEARS = [1990, 1995, 2000, 2005]

to_blacklists = {
    1990: (
        "105", # 内生部門計
        "114", # 国内最終需要計
        "115", # 国内需要合計
        "116", # 輸出
        "117", # 調整項
        "119", # 最終需要計
        "120", # 需要合計
        "121", # （控除）輸入
        "122", # （控除）関税
        "123", # （控除）輸入品商品税
        "125", # 最終需要部門計
        "128", # 国内生産額
        "130", # 国内総支出
        ),
    1995: ( # same as 1990
        "105", "114", "115", "116", "117", "119", "120",
        "121", "122", "123", "125", "128", "130",
        ),
    2000: ( # same as 1990
        "105", "114", "115", "116", "117", "119", "120",
        "121", "122", "123", "125", "128", "130",
        ),
    2005: (
        "109", # 内生部門計
        "118", # 国内最終需要計
        "119", # 国内需要合計
        "120", # 輸出
        "121", # 調整項
        "123", # 最終需要計
        "124", # 需要合計
        "125", # （控除）輸入
        "126", # （控除）関税
        "127", # （控除）輸入品商品税
        "129", # 最終需要部門計
        "132", # 国内生産額
        "133", # 国内総生産（支出側）
        ),
    }

from_blacklists = {
    1990: (
        "105", # 内生部門計
        "107", # 家計外消費支出
        "108", # 雇用者所得
        "109", # 営業余剰
        "110", # 資本減耗引当
        "111", # 資本減耗引当（社会資本等減耗分）
        "112", # 間接税（除関税）
        "113", # （控除）経常補助金
        "114", # ダブルインフレーション調整項
        "125", # 粗付加価値部門計
        "128", # 国内生産額
        "129", # 国内純生産（要素費用）
        "130", # 国内総生産
        ),
    1995: ( # same as 1990
        "105", "107", "108", "109", "110", "111", "112",
        "113", "114", "125", "128", "129", "130",
        ),
    2000: ( # same as 1990, but no 114
        "105", "107", "108", "109", "110", "111",
        "112", "113", "125", "128", "129", "130",
        ),
    2005: (
        "109", # 内生部門計
        "111", # 家計外消費支出
        "112", # 雇用者所得
        "113", # 営業余剰
        "114", # 資本減耗引当
        "115", # 資本減耗引当（社会資本等減耗分）
        "116", # 間接税（除関税）
        "117", # （控除）経常補助金
        "129", # 粗付加価値部門計
        "132", # 国内生産額
        "133", # 国内純生産（要素費用）
        "134", # 国内総生産（生産側）
        ),
    }

pce_sector = {
    1990: "108",
    1995: "108",
    2000: "108",
    2005: "112",
    }

export_sector = {
    1990: "118",
    1995: "118",
    2000: "118",
    2005: "112",
    }

fd_sectors = {
    1990: (
        "107", # 家計外消費支出
        "108", # 民間消費支出
        "109", # 一般政府消費支出
        "110", # 一般政府消費支出（社会資本等減耗分）
        "111", # 国内総固定資本形成（公的）
        "112", # 国内総固定資本形成（民間）
        "113", # 在庫純増
        "118", # 輸出計
        "124", # （控除）輸入計
        ),
    1995: ( # same as 1990
        "107", "108", "109", "110", "111", "112", "113", "118", "124",
        ),
    2000: ( # same as 1990
        "107", "108", "109", "110", "111", "112", "113", "118", "124",
        ),
    2005: (
        "111", # 家計外消費支出（列）
        "112", # 民間消費支出
        "113", # 一般政府消費支出
        "114", # 一般政府消費支出（社会資本等減耗分）
        "115", # 国内総固定資本形成（公的）
        "116", # 国内総固定資本形成（民間）
        "117", # 在庫純増
        "122", # 輸出計
        "128", # （控除）輸入計
        ),
    }

env_series = {
    "CO2": {
        1990: "直接CO2排出量 (Mg-CO2)",
        1995: "直接CO2排出量 (Mg-CO2)",
        2000: "直接CO2排出量 (t-CO2)",
        2005: "直接CO2排出量 (t-CO2)",
        },
    "EU": {
        1990: "直接エネルギー消費量 (GJ)",
        1995: "直接エネルギー消費量 (GJ)",
        2000: "直接エネルギー消費量 (GJ)",
        2005: "直接エネルギー消費量 (GJ)",
        },
    }
